app/controllers/ganjalocs_controller.rb

    def index
      # BEGIN Simple search functionality was implemented by Dawit Haile
        if params[:search].present?
        @ganjalocs = Ganjaloc.near(params[:search], 5).order("created_at DESC")
        @ganjalocs if @ganjalocs.present?

        else
          @ganjalocs = Ganjaloc.all
        end
        # End of Simple search funct...

        @hash = Gmaps4rails.build_markers(@ganjalocs) do |ganjaloc, marker|
            marker.lat ganjaloc.latitude
            marker.lng ganjaloc.longitude
            marker.title ganjaloc.title
        end
        #@ganjalocs = @ganjalocs.order("title").page(params[:page]).per_page(4)
        @ganjalocs = @ganjalocs.page(params[:page]).per_page(4)
---
SELECT "ganjalocs".* FROM "ganjalocs"
SELECT "ganjalocs".* FROM "ganjalocs" LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "ganjalocs"

  def show
  @ganjalocs=Ganjaloc.all
---
SELECT ganjalocs.*, (69.09332411348201 * ABS(ganjalocs.latitude - 1.5) * 0.7071067811865475) + (59.836573914187355 * ABS(ganjalocs.longitude - 1.5) * 0.7071067811865475) AS distance, CASE WHEN (ganjalocs.latitude >= 1.5 AND ganjalocs.longitude >= 1.5) THEN 45.0 WHEN (ganjalocs.latitude < 1.5 AND ganjalocs.longitude >= 1.5) THEN 135.0 WHEN (ganjalocs.latitude < 1.5 AND ganjalocs.longitude < 1.5) THEN 225.0 WHEN (ganjalocs.latitude >= 1.5 AND ganjalocs.longitude < 1.5) THEN 315.0 END AS bearing FROM "ganjalocs" WHERE (ganjalocs.latitude BETWEEN 1.355268216889152 AND 1.644731783110848 AND ganjalocs.longitude BETWEEN 1.3552186039207117 AND 1.6447813960792883 AND ganjalocs.id != 980190962) ORDER BY distance ASC

  def create
    @ganjaloc = Ganjaloc.new(ganjaloc_params)

    respond_to do |format|
      if @ganjaloc.save
---
INSERT INTO "ganjalocs" ("address", "created_at", "description", "latitude", "longitude", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @ganjaloc.update(ganjaloc_params)
---
UPDATE "ganjalocs" SET "description" = ?, "title" = ?, "updated_at" = ? WHERE "ganjalocs"."id" = 980190962  [["description", "Vally and Csula"], ["title", "GreenBear"], ["updated_at", Fri, 25 Apr 2014 02:39:27 UTC +00:00]]

  def destroy
    @ganjaloc.destroy
---
DELETE FROM "ganjalocs" WHERE "ganjalocs"."id" = ?  [["id", 980190962]]

    def set_ganjaloc
      @ganjaloc = Ganjaloc.find(params[:id])
---
SELECT "ganjalocs".* FROM "ganjalocs" WHERE "ganjalocs"."id" = ? LIMIT 1  [["id", "980190962"]]