app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 25 Apr 2014 04:54:29 UTC +00:00], ["email", "secret"], ["name", "Dawit"], ["updated_at", Fri, 25 Apr 2014 04:54:29 UTC +00:00]]
---
    def create
    	@user=User.new(user_params)
    	if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "980190962"]]
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = 980190962  [["name", "nayak Haile"], ["email", "nayakdawit2@gmail.com"], ["updated_at", Fri, 25 Apr 2014 07:07:54 UTC +00:00]]
---
  def update
     @user = User.find(params[:id])
      respond_to do |format|
        if @user.update_attributes(user_params)